{"format": "graph-model", "generatedBy": "2.13.0", "convertedBy": "TensorFlow.js Converter v4.11.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/recommender_net/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot/axes_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot/GatherV2_3/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot/Const_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "610"}, {"size": "50"}]}}}}}, {"name": "StatefulPartitionedCall/recommender_net/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/recommender_net/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/recommender_net/embedding/embedding_lookup/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9724"}, {"size": "50"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/recommender_net/strided_slice_2/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/recommender_net/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net/strided_slice_2/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/recommender_net/embedding_2/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot/free_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}}}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot/GatherV2_2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot/concat_2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "unknown_0", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "610"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/recommender_net/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/recommender_net/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/recommender_net/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/recommender_net/embedding_1/embedding_lookup/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9724"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/recommender_net/strided_slice_3/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net/strided_slice_3/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net/strided_slice_3/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/recommender_net/embedding_3/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "2"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/recommender_net/strided_slice", "op": "StridedSlice", "input": ["input_1", "StatefulPartitionedCall/recommender_net/strided_slice/stack", "StatefulPartitionedCall/recommender_net/strided_slice/stack_1", "StatefulPartitionedCall/recommender_net/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "end_mask": {"i": "1"}, "T": {"type": "DT_INT64"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "2"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/recommender_net/strided_slice_2", "op": "StridedSlice", "input": ["input_1", "StatefulPartitionedCall/recommender_net/strided_slice_2/stack", "StatefulPartitionedCall/recommender_net/strided_slice_2/stack_1", "StatefulPartitionedCall/recommender_net/strided_slice_2/stack_2"], "attr": {"begin_mask": {"i": "1"}, "shrink_axis_mask": {"i": "2"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT64"}, "end_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/recommender_net/strided_slice_1", "op": "StridedSlice", "input": ["input_1", "StatefulPartitionedCall/recommender_net/strided_slice_1/stack", "StatefulPartitionedCall/recommender_net/strided_slice_1/stack_1", "StatefulPartitionedCall/recommender_net/strided_slice_1/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "2"}, "end_mask": {"i": "1"}, "T": {"type": "DT_INT64"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/recommender_net/strided_slice_3", "op": "StridedSlice", "input": ["input_1", "StatefulPartitionedCall/recommender_net/strided_slice_3/stack", "StatefulPartitionedCall/recommender_net/strided_slice_3/stack_1", "StatefulPartitionedCall/recommender_net/strided_slice_3/stack_2"], "attr": {"shrink_axis_mask": {"i": "2"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/recommender_net/embedding/embedding_lookup", "op": "GatherV2", "input": ["unknown", "StatefulPartitionedCall/recommender_net/strided_slice", "StatefulPartitionedCall/recommender_net/embedding/embedding_lookup/axis"], "attr": {"Taxis": {"type": "DT_INT64"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT64"}, "Tparams": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/recommender_net/embedding_2/embedding_lookup", "op": "GatherV2", "input": ["unknown_1", "StatefulPartitionedCall/recommender_net/strided_slice_2", "StatefulPartitionedCall/recommender_net/embedding_2/embedding_lookup/axis"], "attr": {"Tindices": {"type": "DT_INT64"}, "Tparams": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}, "Taxis": {"type": "DT_INT64"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/recommender_net/embedding_1/embedding_lookup", "op": "GatherV2", "input": ["unknown_0", "StatefulPartitionedCall/recommender_net/strided_slice_1", "StatefulPartitionedCall/recommender_net/embedding_1/embedding_lookup/axis"], "attr": {"Taxis": {"type": "DT_INT64"}, "Tparams": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}, "Tindices": {"type": "DT_INT64"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/recommender_net/embedding_3/embedding_lookup", "op": "GatherV2", "input": ["unknown_2", "StatefulPartitionedCall/recommender_net/strided_slice_3", "StatefulPartitionedCall/recommender_net/embedding_3/embedding_lookup/axis"], "attr": {"batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT64"}, "_has_manual_control_dependencies": {"b": true}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/recommender_net/embedding/embedding_lookup"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot/Shape_1", "op": "Shape", "input": ["StatefulPartitionedCall/recommender_net/embedding_2/embedding_lookup"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/recommender_net/Tensordot/Shape", "StatefulPartitionedCall/recommender_net/Tensordot/axes", "StatefulPartitionedCall/recommender_net/Tensordot/GatherV2_1/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/recommender_net/Tensordot/Shape", "StatefulPartitionedCall/recommender_net/Tensordot/free", "StatefulPartitionedCall/recommender_net/Tensordot/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot/GatherV2_3", "op": "GatherV2", "input": ["StatefulPartitionedCall/recommender_net/Tensordot/Shape_1", "StatefulPartitionedCall/recommender_net/Tensordot/axes_1", "StatefulPartitionedCall/recommender_net/Tensordot/GatherV2_3/axis"], "attr": {"batch_dims": {"i": "0"}, "Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot/GatherV2_2", "op": "GatherV2", "input": ["StatefulPartitionedCall/recommender_net/Tensordot/Shape_1", "StatefulPartitionedCall/recommender_net/Tensordot/free_1", "StatefulPartitionedCall/recommender_net/Tensordot/GatherV2_2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/recommender_net/Tensordot/GatherV2_1", "StatefulPartitionedCall/recommender_net/Tensordot/Const_1"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/recommender_net/Tensordot/GatherV2", "StatefulPartitionedCall/recommender_net/Tensordot/Const"], "attr": {"keep_dims": {"b": false}, "T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot/Prod_3", "op": "Prod", "input": ["StatefulPartitionedCall/recommender_net/Tensordot/GatherV2_3", "StatefulPartitionedCall/recommender_net/Tensordot/Const_3"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot/Prod_2", "op": "Prod", "input": ["StatefulPartitionedCall/recommender_net/Tensordot/GatherV2_2", "StatefulPartitionedCall/recommender_net/Tensordot/Const_2"], "attr": {"T": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot/concat_2", "op": "ConcatV2", "input": ["StatefulPartitionedCall/recommender_net/Tensordot/GatherV2", "StatefulPartitionedCall/recommender_net/Tensordot/GatherV2_2", "StatefulPartitionedCall/recommender_net/Tensordot/concat_2/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/recommender_net/Tensordot/Prod", "StatefulPartitionedCall/recommender_net/Tensordot/Prod_1"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot/stack_1", "op": "Pack", "input": ["StatefulPartitionedCall/recommender_net/Tensordot/Prod_3", "StatefulPartitionedCall/recommender_net/Tensordot/Prod_2"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/recommender_net/embedding/embedding_lookup", "StatefulPartitionedCall/recommender_net/Tensordot/stack"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/recommender_net/embedding_2/embedding_lookup", "StatefulPartitionedCall/recommender_net/Tensordot/stack_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/recommender_net/Tensordot/Reshape", "StatefulPartitionedCall/recommender_net/Tensordot/Reshape_1"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/recommender_net/Tensordot/MatMul", "StatefulPartitionedCall/recommender_net/Tensordot/concat_2"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/recommender_net/add", "op": "AddV2", "input": ["StatefulPartitionedCall/recommender_net/Tensordot", "StatefulPartitionedCall/recommender_net/embedding_1/embedding_lookup"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/recommender_net/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/recommender_net/add", "StatefulPartitionedCall/recommender_net/embedding_3/embedding_lookup"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/recommender_net/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/recommender_net/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/recommender_net/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1482}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/recommender_net/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot/axes", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot/axes_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot/GatherV2_3/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot/Const_3", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "unknown", "shape": [610, 50], "dtype": "float32"}, {"name": "StatefulPartitionedCall/recommender_net/strided_slice/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net/strided_slice/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net/strided_slice/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net/embedding/embedding_lookup/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot/free", "shape": [0], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "unknown_1", "shape": [9724, 50], "dtype": "float32"}, {"name": "StatefulPartitionedCall/recommender_net/strided_slice_2/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net/strided_slice_2/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net/strided_slice_2/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net/embedding_2/embedding_lookup/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot/free_1", "shape": [0], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot/GatherV2_2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net/Tensordot/concat_2/axis", "shape": [], "dtype": "int32"}, {"name": "unknown_0", "shape": [610, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/recommender_net/strided_slice_1/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net/strided_slice_1/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net/strided_slice_1/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net/embedding_1/embedding_lookup/axis", "shape": [], "dtype": "int32"}, {"name": "unknown_2", "shape": [9724, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/recommender_net/strided_slice_3/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net/strided_slice_3/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net/strided_slice_3/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net/embedding_3/embedding_lookup/axis", "shape": [], "dtype": "int32"}]}]}